In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
     index=['cobra', 'viper', 'sidewinder'],
     columns=['max_speed', 'shield'])

In [3]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [4]:
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [5]:
df.loc[['viper', 'sidewinder']]

            max_speed  shield
viper               4       5
sidewinder          7       8

In [6]:
df.loc['cobra', 'shield']

2

In [7]:
df.loc['cobra':'viper', 'max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

In [8]:
df.loc[df['shield'] > 6]

            max_speed  shield
sidewinder          7       8

In [9]:
df.loc[df['shield'] > 6, ['max_speed']]

            max_speed
sidewinder          7

In [13]:
df.loc[:, 'max_speed']

cobra         1
viper         4
sidewinder    7
Name: max_speed, dtype: int64

In [14]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
df = pd.DataFrame(mydict)

In [15]:
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [16]:
df.iloc[[0]]

   a  b  c  d
0  1  2  3  4

In [17]:
df.iloc[[0,1]]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [18]:
df.iloc[:3]

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [19]:
df.iloc[0, 1]

2

In [20]:
df.iloc[[0, 2], [1, 3]]

      b     d
0     2     4
2  2000  4000

In [21]:
df.iloc[1:3, 0:3]

      a     b     c
1   100   200   300
2  1000  2000  3000

In [22]:
df['a']

0       1
1     100
2    1000
Name: a, dtype: int64

In [26]:
df[0:2]

     a    b    c    d
0    1    2    3    4
1  100  200  300  400

In [27]:
df[["b"]]

      b
0     2
1   200
2  2000